{"basics":{"name":"Hannah Lee","label":"PhD Student","image":"","email":"hannah9@illinois.edu","phone":"","url":"https://hannahjmlee.github.io","summary":"","location":{"address":"1005 W. Stoughton St. Apt. 205","postalCode":"IL 61801","city":"Urbana","countryCode":"US","region":"Illinois"}},"education":[{"institution":"University of Illinois Urbana-Champaign","location":"Champaign, IL","url":"https://illinois.edu/","area":"Computer Science","studyType":"PhD - Doctor of Philosophy","startDate":"2020-08","endDate":"2025-05","score":"3.93","courses":["Multi-Robot Task and Motion Planning"]},{"institution":"Colorado School of Mines","location":"Golden, CO","url":"https://www.mines.edu/","area":"Computer Science","studyType":"BS - Bachelor of Science","startDate":"2016-08","endDate":"2019-12","score":"3.95","courses":["Major: Computer Science - Robotics and Intelligent Systems","Minor: Electrical Engineering - Digital Systems"]}],"awards":[{"title":"NSF Graduate Research Fellowship","date":"2020-08","awarder":"National Science Foundation","url":"https://www.nsfgrfp.org/","summary":"The NSF Graduate Research Fellowship Program (NSF GRFP) provides funding to outstanding graduate students in STEM fields, supporting their research and education with a focus on promoting diversity and excellence."},{"title":"Graduated Summa Cum Laude","date":"2019-12","awarder":"Colorado School of Mines","summary":"Colorado School of Mines awards the designations of Cum Laude, Magna Cum Laude and Summa Cum Laude upon graduation. Summa Cum Laude is awarded to those graduating with the highest honors with a cumulative GPA of 3.90-4.00."},{"title":"Faculty Choice Senior Award","date":"2019-12","awarder":"Computer Science Department","summary":"The Computer Science Department at the Colorado School of Mines awards the Faculty Choice Senior Award to the senior that they believe contributed most to the CS Department during their undergraduate career."},{"title":"Grace Hopper Celebration Research Scholarship","date":"2019-10","awarder":"ACM-WP","summary":"The Grace Hopper Celebration (GHC) Research Scholars program is a scholarship that provides undergraduate women with the opportunity to attend and present their research at the annual GHC."}],"work":[{"name":"Graduate Research Assistant - Parasol Lab","startDate":"2020-08","endDate":"2025-05","summary":"As a graduate student working with Dr. Nancy M. Amato, I develop novel hybrid task and motion planning algorithms that focus on scalability, performance, and robustness in multi-robot systems. In my research, we have explored ways to incorporate distributed and online planning for constraint-based search algorithms to expand their capabilities to real-world deployments. Additionally, we have included the parallelization of these methods using multithreading to furhter improve their performance in these distributed scnearios. As a member of the Parasol Lab, I have also helped lead the open-source project that works to open source the Parasol Planning Library (PPL), a C++ library that develops novel planning algorithms."},{"name":"Student Technical Assistant - MIT Lincoln Laboratory","startDate":"2023-05","summary":"At MIT Lincoln Laboratory, I develop advanced multi-robot collaboration algorithms. Beginning as an intern in the summer of 2023, I have continued as a student technical assistant, focusing on creating planning frameworks and hierarchies for decentralized settings, online planning, and volatile environments, specifically for surface and drone vehicle coordination."},{"name":"DREU Student Researcher - Parasol Lab","startDate":"2019-05","endDate":"2020-08","summary":"As a participant in the Distributed Research Experience for Undergraduates (DREU) program, I worked as a summer intern researcher at the Parasol Lab. Using C++, I developed the Task and Motion Planning Conflict-Based Search algorithm, an optimal multi-agent multi-task planning solution for payload transportation tasks with complex dependencies using heterogeneous robot teams. I continued my research with the lab throughout my undergraduate year, eventually joining the Parasol Lab for graduate school."},{"name":"Undergraduate Student Researcher - MInDS@Mines Lab","startDate":"2018-11","endDate":"2019-08","summary":"At the MInDS@Mines Lab led by Dr. Hua Wang, I worked as an undergraduate researcher. MInDS focuses on Machine learning, Informatics, and Data Science. My role involved assisting graduate students in applying machine learning techniques to analyze complex biological data from diverse sources, developing novel algorithms for large-scale heterogeneous data sets."},{"name":"Software Intern - Ricoh USA, Inc.","startDate":"2018-06","endDate":"2018-08","summary":"As a software intern at Ricoh, I utilized JavaScript and Django to redesign an automated testing website for simulating physical prints made by cutsheet printers, enhancing the efficiency, accuracy, and quality of prints. My improvements to the database functionality and user interface significantly increased the efficiency and functionality of their testing software."},{"name":"CS Capstone - Uber Technologies, Inc.","startDate":"2018-05","endDate":"2018-06","summary":"During our CS Capstone project with Uber, we developed a proof-of-concept phone application that verifies user locations by creating and comparing 3D models from 2D images. We automated image processing using Python and developed a mobile application with Java to capture and dispatch images to our testing server, utilizing openMVG, openSFM, and MeshLab for 3D model creation."},{"name":"Summer Intern - Computer Science Department","startDate":"2017-05","endDate":"2017-08","summary":"As a summer intern for the CS department, I organized and led outreach events, summer camps, and K-12 teacher workshops. I coordinated CS career events for high school students, presented at STEM fairs, and conducted summer camps teaching middle school students to code in Racket and Java. I also taught Python Computing: Building a Sensor System (CSCI250) and assisted with K-12 workshops, including Python Training Camp and Computer Science Professional Development Week."},{"name":"Lead Instructor - AI4ALL","startDate":"2021-01","summary":"Starting as a teaching assistant and progressing to lead instructor, I work with AI4ALL, a program aimed at diversifying the AI workforce. I taught the Discover AI course from 2021 to 2023 and now teach the Ignite AI course, covering basic AI and ML concepts and ethics. As a lead instructor, I create course materials, present interactive workshops, mentor new instructors, and manage course logistics."},{"name":"Adjunct Professor - CSCI261","startDate":"2020-01","endDate":"2020-05","summary":"After graduating from Colorado School of Mines, I taught CSCI 261: Programming Concepts as an adjunct professor during the spring semester before starting graduate school. This introductory C++ course focused on core programming concepts for students from various majors."},{"name":"Teaching Assistant - Computer Science Department","startDate":"2017-01","endDate":"2020-05","summary":"As an undergraduate at the Colorado School of Mines, I worked as a teaching assistant for CSCI 101: Introduction to Computer Science and CSCI 262: Data Structures. My responsibilities included record-keeping, classroom instruction, developing classroom materials, and assisting students with homework, projects, and exam preparation."},{"name":"Teaching Assistant - DECTech","startDate":"2017-08","endDate":"2019-12","summary":"DECTech (Discover, Explore, Create, Technology) is an outreach program that introduces grade school girls to STEM topics and careers. As a teaching assistant, I taught various STEM topics through weekly interactive activities and helped manage the DECTech website."}],"publications":[{"name":"PRISM: Online Decentralized Multi-Agent Pathfinding with Rapid Information Sharing using Motion Constraints","publisher":"Submitted and under review for the Workshop on the Algorithmic Foundations of Robotics (WAFR)","releaseDate":"2024","summary":"We present PRISM (Pathfinding with Rapid Information Sharing using Motion Constraints), a novel decentralized algorithm for the multi-task multi-agent pathfinding (MT-MAPF) challenge. PRISM enables numerous agents to concurrently plan safe and efficient paths for multiple tasks while avoiding collisions, using a rapid communication strategy to exchange motion constraint information via info packets. Info packets enhance cooperative pathfinding and maintain situational awareness among agents even when direct communication ceases."},{"name":"An Analysis of Constraint-Based Multi-Agent Pathfinding Algorithms","publisher":"Submitted and under review for IEEE Transaction on Robotics (T-RO)","releaseDate":"2024","summary":"This study delves into characteristics defining constraints as conservative or aggressive in constraint-based search multi-agent pathfinding (MAPF) algorithms. We provide insights into their search behavior, focusing on Conflict-Based Search and Priority-Based Search. Through systematic examination, we recommend aggressive constraints for scenarios with numerous agents or high resolutions, and conservative constraints for prioritizing solution quality. Findings are synthesized in a decision flowchart, aiding users in selecting suitable constraints. Recommendations extend to Multi-Robot Motion Planning (MRMP), emphasizing the importance of considering topological features alongside problem, solution, and representation features. This study informs the design of future MAPF and MRMP algorithms by guiding choices based on constraint classification."},{"name":"Parallel Hierarchical Composition Conflict-Based Search for Optimal Multi-Agent Pathfinding","publisher":"IEEE Robotics and Automation Letters (RA-L)","releaseDate":"2021","url":"https://ieeexplore.ieee.org/abstract/document/9483630","summary":"In this letter, we present the following optimal multi-agent pathfinding (MAPF) algorithms: Hierarchical Composition Conflict-Based Search, Parallel Hierarchical Composition Conflict-Based Search, and Dynamic Parallel Hierarchical Composition Conflict-Based Search. MAPF is the task of finding an optimal set of valid path plans for a set of agents such that no agents collide with present obstacles or each other. The presented algorithms are an extension of Conflict-Based Search (CBS), where the MAPF problem is solved by composing and merging smaller, more easily manageable subproblems. Using the information from these subproblems, the presented algorithms can more efficiently find an optimal solution. Our three presented algorithms demonstrate improved performance for optimally solving MAPF problems consisting of many agents in crowded areas while examining fewer states when compared with CBS and its variant Improved Conflict-Based Search."},{"name":"Multi-Robot Task and Motion Planning With Subtask Dependencies","publisher":"IEEE Robotics and Automation Letters (RA-L)","releaseDate":"2020","url":"https://ieeexplore.ieee.org/abstract/document/9013090","summary":"We present a multi-robot integrated task and motion method capable of handling sequential subtask dependencies within multiply decomposable tasks. We map the multi-robot pathfinding method, Conflict Based Search, to task planning and integrate this with motion planning to create TMP-CBS. TMP-CBS couples task decomposition, allocation, and planning to support cases where the optimal solution depends on robot availability and inter-team conflict avoidance. We show improved planning time for simpler task sets and generate optimal solutions w.r.t. the state space representation for a broader range of problems than prior methods."}],"skills":[{"name":"Technical Experience","icon":"fa-solid fa-hashtag","keywords":["Task and Motion Planning","Robotics","Artificial Intelligence","Machine Learning","Computer Vision","Embedded Systems"]},{"name":"Programming Languages","icon":"fa-solid fa-hashtag","keywords":["C++","Python","Java","C","R","Ruby"]},{"name":"Engineering Software","icon":"fa-solid fa-hashtag","keywords":["Robot Operating System","MATLAB","Solidworks (Certified)"]}],"languages":[{"language":"English","fluency":"Native speaker","icon":""},{"language":"Korean","fluency":"Fluent","icon":""}]}