{
  "basics": {
    "name": "Hannah Lee",
    "label": "PhD Student",
    "image": "",
    "email": "hannah9@illinois.edu",
    "phone": "",
    "url": "https://hannahjmlee.github.io",
    "summary": "",
    "location": {
      "address": "1005 W. Stoughton St. Apt. 205",
      "postalCode": "IL 61801",
      "city": "Urbana",
      "countryCode": "US",
      "region": "Illinois"
    }
  },
  "education": [
    {
      "institution": "University of Illinois Urbana-Champaign",
      "location": "Champaign, IL",
      "url": "https://illinois.edu/",
      "area": "Computer Science",
      "studyType": "PhD - Doctor of Philosophy",
      "startDate": "2020-08",
      "endDate": "2025-05",
      "score": "3.93",
      "courses": ["Multi-Robot Task and Motion Planning"]
    }, 
    {
      "institution": "Colorado School of Mines",
      "location": "Golden, CO",
      "url": "https://www.mines.edu/",
      "area": "Computer Science",
      "studyType": "BS - Bachelor of Science",
      "startDate": "2016-08",
      "endDate": "2019-12",
      "score": "3.95",
      "courses": ["Major: Computer Science - Robotics and Intelligent Systems", "Minor: Electrical Engineering - Digital Systems"]
    }
  ],
  "awards": [
    {
      "title": "NSF Graduate Research Fellowship",
      "date": "2020-08",
      "awarder": "National Science Foundation",
      "url": "https://www.nsfgrfp.org/",
      "summary": "The NSF Graduate Research Fellowship Program (NSF GRFP) provides funding to outstanding graduate students in STEM fields, supporting their research and education with a focus on promoting diversity and excellence."
    },
    {
      "title": "Graduated Summa Cum Laude",
      "date": "2019-12",
      "awarder": "Colorado School of Mines",
      "summary": "Colorado School of Mines awards the designations of Cum Laude, Magna Cum Laude and Summa Cum Laude upon graduation. Summa Cum Laude is awarded to those graduating with the highest honors with a cumulative GPA of 3.90-4.00."
    },
    {
      "title": "Faculty Choice Senior Award",
      "date": "2019-12",
      "awarder": "Computer Science Department",
      "summary": "The Computer Science Department at the Colorado School of Mines awards the Faculty Choice Senior Award to the senior that they believe contributed most to the CS Department during their undergraduate career."
    },
    {
      "title": "Grace Hopper Celebration Research Scholarship",
      "date": "2019-10",
      "awarder": "ACM-WP",
      "summary": "The Grace Hopper Celebration (GHC) Research Scholars program is a scholarship that provides undergraduate women with the opportunity to attend and present their research at the annual GHC."
    }
  ],
  "work": [
    {
      "name": "NSF Grduate Research Fellowship",
      "url": "https://example.com",
      "startDate": "1933-01-01",
      "endDate": "1955-01-01",
      "summary": "Teaching at Palmer Physical Laboratory (now 302 Frist Campus Center). While not a professor at Princeton, I associated with the physics professors and continued to give lectures on campus.",
      "highlights": ["Relativity"]
    }
  ],
  "publications": [
    {
      "name": "PRISM: Online Decentralized Multi-Agent Pathfinding with Rapid Information Sharing using Motion Constraints",
      "publisher": "Submitted and under review for the Workshop on the Algorithmic Foundations of Robotics (WAFR)",
      "releaseDate": "2024",
      "summary": "We present PRISM (Pathfinding with Rapid Information Sharing using Motion Constraints), a novel decentralized algorithm for the multi-task multi-agent pathfinding (MT-MAPF) challenge. PRISM enables numerous agents to concurrently plan safe and efficient paths for multiple tasks while avoiding collisions, using a rapid communication strategy to exchange motion constraint information via info packets. Info packets enhance cooperative pathfinding and maintain situational awareness among agents even when direct communication ceases."
    },
    {
      "name": "An Analysis of Constraint-Based Multi-Agent Pathfinding Algorithms",
      "publisher": "Submitted and under review for IEEE Transaction on Robotics (T-RO)",
      "releaseDate": "2024",
      "summary": "This study delves into characteristics defining constraints as conservative or aggressive in constraint-based search multi-agent pathfinding (MAPF) algorithms. We provide insights into their search behavior, focusing on Conflict-Based Search and Priority-Based Search. Through systematic examination, we recommend aggressive constraints for scenarios with numerous agents or high resolutions, and conservative constraints for prioritizing solution quality. Findings are synthesized in a decision flowchart, aiding users in selecting suitable constraints. Recommendations extend to Multi-Robot Motion Planning (MRMP), emphasizing the importance of considering topological features alongside problem, solution, and representation features. This study informs the design of future MAPF and MRMP algorithms by guiding choices based on constraint classification."
    },
    {
      "name": "Parallel Hierarchical Composition Conflict-Based Search for Optimal Multi-Agent Pathfinding",
      "publisher": "IEEE Robotics and Automation Letters (RA-L)",
      "releaseDate": "2021",
      "url": "https://ieeexplore.ieee.org/abstract/document/9483630",
      "summary": "In this letter, we present the following optimal multi-agent pathfinding (MAPF) algorithms: Hierarchical Composition Conflict-Based Search, Parallel Hierarchical Composition Conflict-Based Search, and Dynamic Parallel Hierarchical Composition Conflict-Based Search. MAPF is the task of finding an optimal set of valid path plans for a set of agents such that no agents collide with present obstacles or each other. The presented algorithms are an extension of Conflict-Based Search (CBS), where the MAPF problem is solved by composing and merging smaller, more easily manageable subproblems. Using the information from these subproblems, the presented algorithms can more efficiently find an optimal solution. Our three presented algorithms demonstrate improved performance for optimally solving MAPF problems consisting of many agents in crowded areas while examining fewer states when compared with CBS and its variant Improved Conflict-Based Search."
    },
    {
      "name": "Multi-Robot Task and Motion Planning With Subtask Dependencies",
      "publisher": "IEEE Robotics and Automation Letters (RA-L)",
      "releaseDate": "2020",
      "url": "https://ieeexplore.ieee.org/abstract/document/9013090",
      "summary": "We present a multi-robot integrated task and motion method capable of handling sequential subtask dependencies within multiply decomposable tasks. We map the multi-robot pathfinding method, Conflict Based Search, to task planning and integrate this with motion planning to create TMP-CBS. TMP-CBS couples task decomposition, allocation, and planning to support cases where the optimal solution depends on robot availability and inter-team conflict avoidance. We show improved planning time for simpler task sets and generate optimal solutions w.r.t. the state space representation for a broader range of problems than prior methods."
    }
  ],
  "skills": [
    {
      "name": "Technical Experience",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Task and Motion Planning", "Robotics", "Artificial Intelligence", "Machine Learning", "Computer Vision", "Embedded Systems"
      ]
    },
    {
      "name": "Programming Languages",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "C++", "Python", "Java", "C", "R", "Ruby"
      ]
    },
    {
      "name": "Engineering Software",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Robot Operating System", "MATLAB", "Solidworks (Certified)"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "Korean",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}
